export const scheduleList: any = {
    '2024-11-05': {
        'БПИ, БПИ09з': [
            { time: '08:45 – 10:20', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '10:30 – 12:05', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '12:15 – 13:50', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '14:35 – 16:10', subject: 'Физика', teacher: 'Иванова Ольга Владимировна', typeOfLesson: 'Лекция' },
            { time: '16:20 – 17:55', subject: 'Физика', teacher: 'Иванова Ольга Владимировна', typeOfLesson: 'Лекция' },
            { time: '18:05 – 19:40', subject: 'Основы российской государственности', teacher: 'Шалагина Светлана Витальевна', typeOfLesson: 'Лекция' },
            { time: '19:50 – 21:15', subject: 'Основы российской государственности', teacher: 'Шалагина Светлана Витальевна', typeOfLesson: 'Лекция' },
        ],
        'БИФз': [
            { time: '9:00 - 10:30', subject: 'Программирование', teacher: 'Кузнецов К.К.', typeOfLesson: 'Лекция' },
            { time: '10:45 - 12:15', subject: 'Алгебра', teacher: 'Смирнов С.С.', typeOfLesson: 'Лабораторная работа' },
            { time: '12:30 - 14:00', subject: 'История', teacher: 'Алексеев А.А.', typeOfLesson: 'Практика' },
            { time: '12:30 - 14:00', subject: 'Инженерная графика', teacher: 'Попов К.А.', typeOfLesson: 'Самостоятельная работа' },
        ],
    },
    '2024-11-06': {
        'БПИ, БПИ09з': [
            { time: '08:45 – 10:20', subject: 'Дискретная математика', teacher: 'Тухватуллина Ляйсан Ринатовна', typeOfLesson: 'Лекция' },
            { time: '10:30 – 12:05', subject: 'Дискретная математика', teacher: 'Тухватуллина Ляйсан Ринатовна', typeOfLesson: 'Лекция' },
            { time: '12:15 – 13:50', subject: 'Дискретная математика', teacher: 'Тухватуллина Ляйсан Ринатовна', typeOfLesson: 'Лекция' },
            { time: '14:35 – 16:10', subject: 'Свободное время', teacher: '', typeOfLesson: 'Окно' },
            { time: '16:20 – 17:55', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
            { time: '18:05 – 19:40', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
        ],
        'БИФз': [
            { time: '9:00 - 10:30', subject: 'Программирование', teacher: 'Кузнецов К.К.', typeOfLesson: 'Лекция' },
            { time: '10:45 - 12:15', subject: 'Алгебра', teacher: 'Смирнов С.С.', typeOfLesson: 'Практика' },
            { time: '12:30 - 14:00', subject: 'История', teacher: 'Алексеев А.А.', typeOfLesson: 'Лабораторная работа' },
            { time: '12:30 - 14:00', subject: 'Инженерная графика', teacher: 'Попов К.А.', typeOfLesson: 'Самостоятельная работа' },
        ],
    },
    '2024-11-07': {
        'БПИ, БПИ09з': [
            { time: '08:45 – 10:20', subject: 'Свободное время', teacher: '', typeOfLesson: 'Окно' },
            { time: '10:30 – 12:05', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
            { time: '12:15 – 13:50', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
            { time: '14:35 – 16:10', subject: 'Инженерная компьютерная графика', teacher: 'Набиев Рифкат Ильшатович', typeOfLesson: 'Лекция' },
            { time: '16:20 – 17:55', subject: 'Свободное время', teacher: '', typeOfLesson: 'Окно' },
            { time: '18:05 – 19:40', subject: 'Основы российской государственности', teacher: 'Шалагина Светлана Витальевна', typeOfLesson: 'Лекция' },
        ],
    },
    '2024-11-08': {
        'БПИ, БПИ09з': [
            { time: '08:45 – 10:20', subject: 'Физика', teacher: 'Иванова Ольга Владимировна', typeOfLesson: 'Лекция' },
            { time: '10:30 – 12:05', subject: 'Физика', teacher: 'Иванова Ольга Владимировна', typeOfLesson: 'Лекция' },
            { time: '12:15 – 13:50', subject: 'Основы российской государственности', teacher: 'Шалагина Светлана Витальевна', typeOfLesson: 'Лекция' },
            { time: '14:35 – 16:10', subject: 'Основы российской государственности', teacher: 'Шалагина Светлана Витальевна', typeOfLesson: 'Практика' },
            { time: '16:20 – 17:55', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
            { time: '18:05 – 19:40', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Практика' },
            { time: '19:50 – 21:15', subject: 'Инженерная компьютерная графика', teacher: 'Набиев Рифкат Ильшатович', typeOfLesson: 'Лекция' },
        ],
    },
    '2024-11-09': {
        'БПИ, БПИ09з': [
            { time: '08:45 – 10:20', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Лекция' },
            { time: '10:30 – 12:05', subject: 'Математика', teacher: 'Гильмутдинов Риф Забирович', typeOfLesson: 'Практика' },
            { time: '12:15 – 13:50', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '14:35 – 16:10', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '16:20 – 17:55', subject: 'История России', teacher: 'Вильданов Руслан Раисович', typeOfLesson: 'Лекция' },
            { time: '18:05 – 19:40', subject: 'Инженерная компьютерная графика', teacher: 'Набиев Рифкат Ильшатович', typeOfLesson: 'Лекция' },
        ],
    },
}


export default scheduleList